cask_args appdir: "/Applications"

brew "mas"

brew "cloc"
brew "coreutils"
brew "grc"
cask "rar"
brew "spark"
brew "vim"
brew "wget"
brew "zsh-completions"

brew "git"
brew "git-lfs"
brew "hub"

brew "go"
brew "gofumpt"
brew "golangci-lint"
brew "gopls"
brew "protobuf"
brew "protoc-gen-go"
brew "protoc-gen-go-grpc"

cask "1password"
cask "aldente"
cask "appcleaner"
cask "chai"
cask "chatgpt"
cask "font-jetbrains-mono"
cask "google-chrome"
cask "macdown"
cask "mediamate"
cask "obs"
cask "vlc"
cask "zed"

mas "1Password for Safari", id: 1569813296
mas "FoXray", id: 6448898396
mas "Hand Mirror", id: 1502839586
mas "Pure Paste", id: 1611378436
mas "rcmd", id: 1596283165
