cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'mas'

brew 'cloc'
brew 'gls'
brew 'grc'
brew 'spark'
brew 'vim'
brew 'wget'
cask 'rar'

brew 'git'
brew 'git-lfs'
brew 'hub'
brew 'spaceman-diff'

brew 'go'
brew 'gopls'
brew 'gofumpt'
brew 'protoc'
brew 'protoc-gen-go'
brew 'protoc-gen-go-grpc'

cask '1password'
cask 'aldente'
cask 'appcleaner'
cask 'chai'
cask 'chatgpt'
cask 'font-jetbrains-mono'
cask 'google-chrome'
cask 'mediamate'
cask 'obs'
cask 'vlc'
cask 'zed'

mas '1Password for Safari', id: 1569813296
mas 'FoXray', id: 6448898396
mas 'Hand Mirror', id: 1502839586
mas 'Pure Paste', id: 1611378436
mas 'rcmd', id: 1596283165
